cask_args appdir: '/Applications'

brew 'mas'
tap 'Homebrew/bundle'
cask 'appcleaner'
cask 'lingon-x'
cask 'alfred'
cask 'istat-menus'
cask 'dropbox'
cask 'dash'
cask 'karabiner-elements'
cask 'virtualbox'
cask 'vagrant'cask 'boom-3d'
cask 'qnapi'
cask 'spotify'
cask 'transmission'
cask 'vlc'
cask 'rubitrack-pro'
cask 'garmin-express'

mas '1Password', id: 443987910
mas 'PopClip', id: 445189367
mas 'Airmail 3', id: 918858936
mas 'Parcel', id: 639968404
mas 'Irvue', id: 1039633667
mas 'Affinity Designer', id: 824171161
mas 'The Unarchiver', id: 425424353