cask_args appdir: '/Applications'
tap 'koekeishiya/formulae'
tap 'ravenac95/sudolikeaboss'

#### os
brew 'mas'
tap 'Homebrew/bundle'
cask 'xquartz'
brew 'coreutils'
brew 'gawk'
cask 'appcleaner'
brew 'parallel'
cask 'lingon-x'
mas '1Password', id: 443987910

#### ui
brew 'koekeishiya/formulae/kwm'
brew 'koekeishiya/formulae/khd'
brew 'kwm', restart_service: :changed
brew 'khd', restart_service: :changed
cask 'ubersicht'
cask 'alfred'
cask 'flux'
cask 'istat-menus'
mas 'PopClip', id: 445189367

#### shell
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'ravenac95/sudolikeaboss/sudolikeaboss'
cask 'iterm2'
brew 'tldr'

#### files
brew 'the_silver_searcher'
brew 'ranger'
cask 'dropbox'
mas 'The Unarchiver', id: 425424353

### provision
brew 'ansible'

#### interwebs
brew 'httpie'
brew 'esphen/wsta/wsta'
brew 'jq'
cask 'iridium-extra'
cask 'airvpn'

#### editor
tap 'railwaycat/emacsmacport'
brew 'railwaycat/emacsmacport/emacs-mac', args: ['with-spacemacs-icon']
brew 'aspell'

#### docs
cask 'dash'

#### keyboard
cask 'karabiner-elements'
cask 'razer-synapse'

#### vcs
brew 'git'
brew 'diff-so-fancy'
brew 'gist'
brew 'hub'

#### deploy
brew 'awscli'
brew 'kubernetes-cli'
brew 'homebrew/boneyard/ngrok'
mas 'CCMenu', id: 603117688

#### languages
cask 'java'
brew 'ammonite-repl'
brew 'sbt'
brew 'scala'
brew 'scalariform'
brew 'scalastyle'
brew 'erlang'
brew 'elixir'
brew 'node'
brew 'elm'

#### misc dev
brew 'asciinema'
brew 'wakatime-cli'

#### media
cask 'boom'
cask 'calibre'
cask 'send-to-kindle'
cask 'qnapi'
cask 'spotify'
cask 'transmission'
cask 'vlc'

#### communication
mas 'Airmail 3', id: 918858936
mas 'Slack', id: 803453959
mas 'Tweetbot', id: 557168941

#### design
mas 'Irvue', id: 1039633667
mas 'Deckset', id: 847496013
mas 'Pixelmator', id: 407963104
mas 'Affinity Designer', id: 824171161

#### sports
cask 'rubitrack-pro'
cask 'garmin-express'

### misc
mas 'Parcel', id: 639968404
